# Setup

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('university.db')
cursor = conn.cursor()

# DDL

In [3]:
# Drop all the tables
cursor.executescript('''
DROP TABLE IF EXISTS Performance;
DROP TABLE IF EXISTS Submissions;
DROP TABLE IF EXISTS Assessments;
DROP TABLE IF EXISTS Courses;
DROP TABLE IF EXISTS Enrollment;
DROP TABLE IF EXISTS Students;
DROP TABLE IF EXISTS Instructors;
DROP TABLE IF EXISTS Prerequisite;
''')

In [4]:
# Recreate the tables with foreign key constraints
cursor.executescript('''
-- Create Students table
CREATE TABLE Students (
    StudentID INTEGER PRIMARY KEY,
    Username VARCHAR(50) NOT NULL UNIQUE,
    Password VARCHAR(50) NOT NULL,
    First_Name VARCHAR(50),
    Last_Name VARCHAR(50),
    EnrollmentDate DATE,
    DateOfBirth DATE,
    Email VARCHAR(100),
    PhoneNumber VARCHAR(20),
    Address VARCHAR(200)
);

-- Create Instructors table
CREATE TABLE Instructors (
    InstructorID INTEGER PRIMARY KEY,
    Username VARCHAR(50) NOT NULL UNIQUE,
    Password VARCHAR(50) NOT NULL,
    First_Name VARCHAR(50),
    Last_Name VARCHAR(50),
    Email VARCHAR(100),
    HireDate DATE,
    PhoneNumber VARCHAR(20),
    Specialization VARCHAR(100)
);

-- Create Prerequisite table
CREATE TABLE Prerequisite (
    PrerequisiteID INTEGER PRIMARY KEY,
    NumberOfPrerequisite INTEGER,
    Completed BOOLEAN
);

-- Create Courses table with foreign key references
CREATE TABLE Courses (
    CourseID INTEGER PRIMARY KEY,
    CourseName VARCHAR(100),
    Description TEXT,
    MaxEnrollment INTEGER,
    StartDate DATE,
    EndDate DATE,
    PrerequisiteID INTEGER,
    InstructorID INTEGER,
    FOREIGN KEY (PrerequisiteID) REFERENCES Prerequisite(PrerequisiteID),
    FOREIGN KEY (InstructorID) REFERENCES Instructors(InstructorID)
);

-- Create Enrollment table with foreign key references
CREATE TABLE Enrollment (
    EnrollmentID INTEGER PRIMARY KEY,
    EnrollmentDate DATE,
    Status VARCHAR(50),
    StudentID INTEGER,
    CourseID INTEGER,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID)
);

-- Create Assessments table with foreign key references
CREATE TABLE Assessments (
    AssessmentID INTEGER PRIMARY KEY,
    Title VARCHAR(100),
    Type VARCHAR(50),
    MaxScore INTEGER,
    DueDate DATE,
    CourseID INTEGER,
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID)
);

-- Create Submissions table with foreign key references
CREATE TABLE Submissions (
    SubmissionID INTEGER PRIMARY KEY,
    SubmissionDate DATE,
    Feedback TEXT,
    Score INTEGER,
    StudentID INTEGER,
    CourseID INTEGER,
    AssessmentID INTEGER,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID),
    FOREIGN KEY (AssessmentID) REFERENCES Assessments(AssessmentID)
);

-- Create Performance table with foreign key reference
CREATE TABLE Performance (
    PerformanceID INTEGER PRIMARY KEY,
    TotalScore INTEGER,
    Grade VARCHAR(2),
    StudentID INTEGER,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID)
);
''')

In [5]:
# Insert data into the tables
cursor.executescript('''
-- Insert data into Students
INSERT INTO Students (StudentID, Username, Password, First_Name, Last_Name, EnrollmentDate, DateOfBirth, Email, PhoneNumber, Address)
VALUES
(1, 'ahmad123', 'pass123', 'Ahmad', 'Al-Faisal', '2023-09-01', '2002-05-15', 'ahmad.faisal@gmail.com', '0551234567', 'Riyadh, Saudi Arabia'),
(2, 'layla89', 'layla789', 'Layla', 'Al-Zahrani', '2023-09-01', '2001-08-22', 'layla.zahrani@gmail.com', '0547654321', 'Jeddah, Saudi Arabia'),
(3, 'omar456', 'omar456', 'Omar', 'Al-Harbi', '2023-09-01', '2003-01-05', 'omar.harbi@gmail.com', '0568765432', 'Dammam, Saudi Arabia'),
(4, 'sara101', 'sara101', 'Sara', 'Al-Qahtani', '2023-09-01', '2002-11-30', 'sara.qahtani@gmail.com', '0559876543', 'Abha, Saudi Arabia'),
(5, 'yousef77', 'yousef777', 'Yousef', 'Al-Subaie', '2023-09-01', '2000-04-18', 'yousef.subaie@gmail.com', '0543219876', 'Medina, Saudi Arabia');

-- Insert data into Instructors
INSERT INTO Instructors (InstructorID, Username, Password, First_Name, Last_Name, Email, HireDate, PhoneNumber, Specialization)
VALUES
(1, 'drhassan', 'drhassan123', 'Hassan', 'Al-Omari', 'hassan.omari@gmail.com', '2015-09-01', '0561239874', 'Artificial Intelligence'),
(2, 'drsanaa', 'sanaa2024', 'Sanaa', 'Al-Shammari', 'sanaa.shammari@gmail.com', '2017-01-15', '0546543210', 'Cybersecurity'),
(3, 'drnoura', 'noura2024', 'Noura', 'Al-Saadi', 'noura.saadi@gmail.com', '2020-03-01', '0559874563', 'Data Science'),
(4, 'drali', 'ali2024', 'Ali', 'Al-Bakri', 'ali.bakri@gmail.com', '2010-05-10', '0537896541', 'Software Engineering'),
(5, 'drsalem', 'salem2024', 'Salem', 'Al-Hazmi', 'salem.hazmi@gmail.com', '2012-07-21', '0548761230', 'Machine Learning');

-- Insert data into Prerequisite
INSERT INTO Prerequisite (PrerequisiteID, NumberOfPrerequisite, Completed)
VALUES
(1, 2, 1),
(2, 1, 1),
(3, 3, 0),
(4, 1, 0),
(5, 0, 1);

-- Insert data into Courses
INSERT INTO Courses (CourseID, CourseName, Description, MaxEnrollment, StartDate, EndDate, PrerequisiteID, InstructorID)
VALUES
(1, 'Introduction to AI', 'Learn the basics of AI', 50, '2024-01-01', '2024-06-01', 1, 1),
(2, 'Cybersecurity Basics', 'Understand cybersecurity concepts', 40, '2024-02-01', '2024-07-01', 2, 2),
(3, 'Data Science Fundamentals', 'Foundations of data science', 30, '2024-03-01', '2024-08-01', 3, 3),
(4, 'Advanced Python', 'Python programming for advanced users', 25, '2024-01-15', '2024-05-15', NULL, 4),
(5, 'Machine Learning Essentials', 'Basics of ML techniques', 35, '2024-04-01', '2024-09-01', 4, 5);

-- Insert data into Enrollment
INSERT INTO Enrollment (EnrollmentID, EnrollmentDate, Status, StudentID, CourseID)
VALUES
(1, '2024-01-05', 'Active', 1, 1),
(2, '2024-01-05', 'Completed', 2, 2),
(3, '2024-01-10', 'Active', 3, 3),
(4, '2024-01-15', 'Dropped', 4, 4),
(5, '2024-01-20', 'Completed', 5, 5);

-- Insert data into Assessments
INSERT INTO Assessments (AssessmentID, Title, Type, MaxScore, DueDate, CourseID)
VALUES
(1, 'AI Quiz 1', 'Quiz', 20, '2024-02-15', 1),
(2, 'Cybersecurity Midterm', 'Exam', 50, '2024-04-01', 2),
(3, 'Data Science Assignment 1', 'Assignment', 30, '2024-03-20', 3),
(4, 'Python Coding Challenge', 'Assignment', 40, '2024-05-01', 4),
(5, 'Machine Learning Final', 'Exam', 100, '2024-09-01', 5);

-- Insert data into Submissions
INSERT INTO Submissions (SubmissionID, SubmissionDate, Feedback, Score, StudentID, CourseID, AssessmentID)
VALUES
(1, '2024-02-16', 'Good work!', 18, 1, 1, 1),
(2, '2024-04-02', 'Needs improvement', 35, 2, 2, 2),
(3, '2024-03-21', 'Excellent', 28, 3, 3, 3),
(4, '2024-05-02', 'Well done', 37, 4, 4, 4),
(5, '2024-09-02', 'Outstanding', 95, 5, 5, 5);

-- Insert data into Performance
INSERT INTO Performance (PerformanceID, TotalScore, Grade, StudentID)
VALUES
(1, 85, 'A', 1),
(2, 70, 'B', 2),
(3, 90, 'A', 3),
(4, 65, 'C', 4),
(5, 95, 'A', 5);
''')

print("Data populated successfully!")

Data populated successfully!

# DML

## Select all

In [6]:
cursor.execute("SELECT * FROM Students")
students_data = cursor.fetchall()
print("\nStudents:")
for student in students_data:
    print(student)

Students:
(1, 'ahmad123', 'pass123', 'Ahmad', 'Al-Faisal', '2023-09-01', '2002-05-15', 'ahmad.faisal@gmail.com', '0551234567', 'Riyadh, Saudi Arabia')
(2, 'layla89', 'layla789', 'Layla', 'Al-Zahrani', '2023-09-01', '2001-08-22', 'layla.zahrani@gmail.com', '0547654321', 'Jeddah, Saudi Arabia')
(3, 'omar456', 'omar456', 'Omar', 'Al-Harbi', '2023-09-01', '2003-01-05', 'omar.harbi@gmail.com', '0568765432', 'Dammam, Saudi Arabia')
(4, 'sara101', 'sara101', 'Sara', 'Al-Qahtani', '2023-09-01', '2002-11-30', 'sara.qahtani@gmail.com', '0559876543', 'Abha, Saudi Arabia')
(5, 'yousef77', 'yousef777', 'Yousef', 'Al-Subaie', '2023-09-01', '2000-04-18', 'yousef.subaie@gmail.com', '0543219876', 'Medina, Saudi Arabia')

In [7]:
cursor.execute("SELECT * FROM Instructors")
instructors_data = cursor.fetchall()
print("\nInstructors:")
for instructor in instructors_data:
    print(instructor)

Instructors:
(1, 'drhassan', 'drhassan123', 'Hassan', 'Al-Omari', 'hassan.omari@gmail.com', '2015-09-01', '0561239874', 'Artificial Intelligence')
(2, 'drsanaa', 'sanaa2024', 'Sanaa', 'Al-Shammari', 'sanaa.shammari@gmail.com', '2017-01-15', '0546543210', 'Cybersecurity')
(3, 'drnoura', 'noura2024', 'Noura', 'Al-Saadi', 'noura.saadi@gmail.com', '2020-03-01', '0559874563', 'Data Science')
(4, 'drali', 'ali2024', 'Ali', 'Al-Bakri', 'ali.bakri@gmail.com', '2010-05-10', '0537896541', 'Software Engineering')
(5, 'drsalem', 'salem2024', 'Salem', 'Al-Hazmi', 'salem.hazmi@gmail.com', '2012-07-21', '0548761230', 'Machine Learning')

In [8]:
cursor.execute("SELECT * FROM Courses")
courses_data = cursor.fetchall()
print("\nCourses:")
for course in courses_data:
    print(course)

Courses:
(1, 'Introduction to AI', 'Learn the basics of AI', 50, '2024-01-01', '2024-06-01', 1, 1)
(2, 'Cybersecurity Basics', 'Understand cybersecurity concepts', 40, '2024-02-01', '2024-07-01', 2, 2)
(3, 'Data Science Fundamentals', 'Foundations of data science', 30, '2024-03-01', '2024-08-01', 3, 3)
(4, 'Advanced Python', 'Python programming for advanced users', 25, '2024-01-15', '2024-05-15', None, 4)
(5, 'Machine Learning Essentials', 'Basics of ML techniques', 35, '2024-04-01', '2024-09-01', 4, 5)

In [9]:
cursor.execute("SELECT * FROM Prerequisite")
prerequisite_data = cursor.fetchall()
print("\nPrerequisites:")
for prerequisite in prerequisite_data:
    print(prerequisite)

Prerequisites:
(1, 2, 1)
(2, 1, 1)
(3, 3, 0)
(4, 1, 0)
(5, 0, 1)

In [10]:
cursor.execute("SELECT * FROM Enrollment")
enrollment_data = cursor.fetchall()
print("\nEnrollment:")
for enrollment in enrollment_data:
    print(enrollment)

Enrollment:
(1, '2024-01-05', 'Active', 1, 1)
(2, '2024-01-05', 'Completed', 2, 2)
(3, '2024-01-10', 'Active', 3, 3)
(4, '2024-01-15', 'Dropped', 4, 4)
(5, '2024-01-20', 'Completed', 5, 5)

In [11]:
cursor.execute("SELECT * FROM Assessments")
assessments_data = cursor.fetchall()
print("\nAssessments:")
for assessment in assessments_data:
    print(assessment)

Assessments:
(1, 'AI Quiz 1', 'Quiz', 20, '2024-02-15', 1)
(2, 'Cybersecurity Midterm', 'Exam', 50, '2024-04-01', 2)
(3, 'Data Science Assignment 1', 'Assignment', 30, '2024-03-20', 3)
(4, 'Python Coding Challenge', 'Assignment', 40, '2024-05-01', 4)
(5, 'Machine Learning Final', 'Exam', 100, '2024-09-01', 5)

In [12]:
cursor.execute("SELECT * FROM Submissions")
submissions_data = cursor.fetchall()
print("\nSubmissions:")
for submission in submissions_data:
    print(submission)

Submissions:
(1, '2024-02-16', 'Good work!', 18, 1, 1, 1)
(2, '2024-04-02', 'Needs improvement', 35, 2, 2, 2)
(3, '2024-03-21', 'Excellent', 28, 3, 3, 3)
(4, '2024-05-02', 'Well done', 37, 4, 4, 4)
(5, '2024-09-02', 'Outstanding', 95, 5, 5, 5)

In [13]:
cursor.execute("SELECT * FROM Performance")
performance_data = cursor.fetchall()
print("\nPerformance:")
for performance in performance_data:
    print(performance)

Performance:
(1, 85, 'A', 1)
(2, 70, 'B', 2)
(3, 90, 'A', 3)
(4, 65, 'C', 4)
(5, 95, 'A', 5)

## Queries Per table

### Students

In [14]:
# 1. Get all students whose first name starts with 'A' using LIKE
cursor.execute("SELECT * FROM Students WHERE First_Name LIKE 'A%'")
students_starting_with_A = cursor.fetchall()
print("\nStudents whose first name starts with 'A':")
for student in students_starting_with_A:
    print(student)

Students whose first name starts with 'A':
(1, 'ahmad123', 'pass123', 'Ahmad', 'Al-Faisal', '2023-09-01', '2002-05-15', 'ahmad.faisal@gmail.com', '0551234567', 'Riyadh, Saudi Arabia')

In [15]:
# 2. Retrieve students born between 2000 and 2002 using BETWEEN
cursor.execute("SELECT * FROM Students WHERE DateOfBirth BETWEEN '2000-01-01' AND '2002-12-31'")
students_born_between_2000_2002 = cursor.fetchall()
print("\nStudents born between 2000 and 2002:")
for student in students_born_between_2000_2002:
    print(student)

Students born between 2000 and 2002:
(1, 'ahmad123', 'pass123', 'Ahmad', 'Al-Faisal', '2023-09-01', '2002-05-15', 'ahmad.faisal@gmail.com', '0551234567', 'Riyadh, Saudi Arabia')
(2, 'layla89', 'layla789', 'Layla', 'Al-Zahrani', '2023-09-01', '2001-08-22', 'layla.zahrani@gmail.com', '0547654321', 'Jeddah, Saudi Arabia')
(4, 'sara101', 'sara101', 'Sara', 'Al-Qahtani', '2023-09-01', '2002-11-30', 'sara.qahtani@gmail.com', '0559876543', 'Abha, Saudi Arabia')
(5, 'yousef77', 'yousef777', 'Yousef', 'Al-Subaie', '2023-09-01', '2000-04-18', 'yousef.subaie@gmail.com', '0543219876', 'Medina, Saudi Arabia')

In [16]:
# 3. Retrieve distinct cities of students using DISTINCT
cursor.execute("SELECT DISTINCT Address FROM Students")
distinct_student_addresses = cursor.fetchall()
print("\nDistinct cities of students:")
for address in distinct_student_addresses:
    print(address)

Distinct cities of students:
('Riyadh, Saudi Arabia',)
('Jeddah, Saudi Arabia',)
('Dammam, Saudi Arabia',)
('Abha, Saudi Arabia',)
('Medina, Saudi Arabia',)

In [17]:
# 4. Retrieve students whose username contains '123' or '101' using OR
cursor.execute("SELECT * FROM Students WHERE Username LIKE '%123%' OR Username LIKE '%101%'")
students_with_username_123_or_101 = cursor.fetchall()
print("\nStudents whose username contains '123' or '101':")
for student in students_with_username_123_or_101:
    print(student)

Students whose username contains '123' or '101':
(1, 'ahmad123', 'pass123', 'Ahmad', 'Al-Faisal', '2023-09-01', '2002-05-15', 'ahmad.faisal@gmail.com', '0551234567', 'Riyadh, Saudi Arabia')
(4, 'sara101', 'sara101', 'Sara', 'Al-Qahtani', '2023-09-01', '2002-11-30', 'sara.qahtani@gmail.com', '0559876543', 'Abha, Saudi Arabia')

In [18]:
# 5. Retrieve student data sorted by enrollment date in descending order
cursor.execute("SELECT * FROM Students ORDER BY EnrollmentDate ASC")
students_sorted_by_enrollment_date = cursor.fetchall()
print("\nStudents sorted by enrollment date in ascending order:")
for student in students_sorted_by_enrollment_date:
    print(student)

Students sorted by enrollment date in ascending order:
(1, 'ahmad123', 'pass123', 'Ahmad', 'Al-Faisal', '2023-09-01', '2002-05-15', 'ahmad.faisal@gmail.com', '0551234567', 'Riyadh, Saudi Arabia')
(2, 'layla89', 'layla789', 'Layla', 'Al-Zahrani', '2023-09-01', '2001-08-22', 'layla.zahrani@gmail.com', '0547654321', 'Jeddah, Saudi Arabia')
(3, 'omar456', 'omar456', 'Omar', 'Al-Harbi', '2023-09-01', '2003-01-05', 'omar.harbi@gmail.com', '0568765432', 'Dammam, Saudi Arabia')
(4, 'sara101', 'sara101', 'Sara', 'Al-Qahtani', '2023-09-01', '2002-11-30', 'sara.qahtani@gmail.com', '0559876543', 'Abha, Saudi Arabia')
(5, 'yousef77', 'yousef777', 'Yousef', 'Al-Subaie', '2023-09-01', '2000-04-18', 'yousef.subaie@gmail.com', '0543219876', 'Medina, Saudi Arabia')

In [19]:
# Aggregate Functions
# a. Count total students
cursor.execute("SELECT COUNT(*) AS Total_Students FROM Students")
total_students = cursor.fetchone()
print("\nTotal Students:", total_students[0])


# b. Find the youngest student's date of birth
cursor.execute("SELECT MIN(DateOfBirth) AS Youngest_Student FROM Students")
youngest_student = cursor.fetchone()
print("\nYoungest Student's Date of Birth:", youngest_student[0])

Total Students: 5

Youngest Student's Date of Birth: 2000-04-18

### Instructors

In [20]:
# 1. Get instructors hired after 2015 using WHERE
cursor.execute("SELECT * FROM Instructors WHERE HireDate > '2015-01-01'")
instructors_hired_after_2015 = cursor.fetchall()
print("\nInstructors hired after 2015:")
for instructor in instructors_hired_after_2015:
    print(instructor)

Instructors hired after 2015:
(1, 'drhassan', 'drhassan123', 'Hassan', 'Al-Omari', 'hassan.omari@gmail.com', '2015-09-01', '0561239874', 'Artificial Intelligence')
(2, 'drsanaa', 'sanaa2024', 'Sanaa', 'Al-Shammari', 'sanaa.shammari@gmail.com', '2017-01-15', '0546543210', 'Cybersecurity')
(3, 'drnoura', 'noura2024', 'Noura', 'Al-Saadi', 'noura.saadi@gmail.com', '2020-03-01', '0559874563', 'Data Science')

In [21]:
# 2. Retrieve all instructors whose specialization includes 'Cybersecurity' using = operator
cursor.execute("SELECT * FROM Instructors WHERE Specialization = 'Cybersecurity'")
instructors_with_CS_specialization = cursor.fetchall()
print("\nInstructors whose specialization includes 'Cybersecurity':")
for instructor in instructors_with_CS_specialization:
    print(instructor)

Instructors whose specialization includes 'Cybersecurity':
(2, 'drsanaa', 'sanaa2024', 'Sanaa', 'Al-Shammari', 'sanaa.shammari@gmail.com', '2017-01-15', '0546543210', 'Cybersecurity')

In [22]:
# 3. Retrieve distinct specializations using DISTINCT
cursor.execute("SELECT DISTINCT Specialization FROM Instructors")
distinct_instructor_specializations = cursor.fetchall()
print("\nDistinct specializations of instructors:")
for specialization in distinct_instructor_specializations:
    print(specialization)

Distinct specializations of instructors:
('Artificial Intelligence',)
('Cybersecurity',)
('Data Science',)
('Software Engineering',)
('Machine Learning',)

In [23]:
# 4. Retrieve instructors where email ends with '.com' and phone starts with '056'
cursor.execute("SELECT * FROM Instructors WHERE Email LIKE '%.com' AND PhoneNumber LIKE '056%'")
instructors_email_com_phone_056 = cursor.fetchall()
print("\nInstructors where email ends with '.com' and phone starts with '056':")
for instructor in instructors_email_com_phone_056:
    print(instructor)

Instructors where email ends with '.com' and phone starts with '056':
(1, 'drhassan', 'drhassan123', 'Hassan', 'Al-Omari', 'hassan.omari@gmail.com', '2015-09-01', '0561239874', 'Artificial Intelligence')

In [24]:
# 5. Retrieve instructor data sorted by specialization in descending order
cursor.execute("SELECT * FROM Instructors ORDER BY Specialization Desc")
instructors_sorted_by_specialization = cursor.fetchall()
print("\nInstructors sorted by specialization in descending order:")
for instructor in instructors_sorted_by_specialization:
    print(instructor)

Instructors sorted by specialization in descending order:
(4, 'drali', 'ali2024', 'Ali', 'Al-Bakri', 'ali.bakri@gmail.com', '2010-05-10', '0537896541', 'Software Engineering')
(5, 'drsalem', 'salem2024', 'Salem', 'Al-Hazmi', 'salem.hazmi@gmail.com', '2012-07-21', '0548761230', 'Machine Learning')
(3, 'drnoura', 'noura2024', 'Noura', 'Al-Saadi', 'noura.saadi@gmail.com', '2020-03-01', '0559874563', 'Data Science')
(2, 'drsanaa', 'sanaa2024', 'Sanaa', 'Al-Shammari', 'sanaa.shammari@gmail.com', '2017-01-15', '0546543210', 'Cybersecurity')
(1, 'drhassan', 'drhassan123', 'Hassan', 'Al-Omari', 'hassan.omari@gmail.com', '2015-09-01', '0561239874', 'Artificial Intelligence')

In [25]:
# Aggregate Functions
# a. Count total instructors
cursor.execute("SELECT COUNT(*) AS Total_Instructors FROM Instructors")
total_instructors = cursor.fetchone()
print("\nTotal Instructors:", total_instructors[0])

# b. Find the most recent hire date
cursor.execute("SELECT MAX(HireDate) AS Latest_Hire_Date FROM Instructors")
latest_hire_date = cursor.fetchone()
print("\nMost Recent Hire Date:", latest_hire_date[0])

Total Instructors: 5

Most Recent Hire Date: 2020-03-01

### Courses

In [26]:
# 1. Get courses with a maximum enrollment greater than 30 using WHERE
cursor.execute("SELECT * FROM Courses WHERE MaxEnrollment > 30")
courses_max_enrollment_gt_30 = cursor.fetchall()
print("\nCourses with a maximum enrollment greater than 30:")
for course in courses_max_enrollment_gt_30:
    print(course)

Courses with a maximum enrollment greater than 30:
(1, 'Introduction to AI', 'Learn the basics of AI', 50, '2024-01-01', '2024-06-01', 1, 1)
(2, 'Cybersecurity Basics', 'Understand cybersecurity concepts', 40, '2024-02-01', '2024-07-01', 2, 2)
(5, 'Machine Learning Essentials', 'Basics of ML techniques', 35, '2024-04-01', '2024-09-01', 4, 5)

In [27]:
# 2. Retrieve all courses taught by a specific instructor using InstructorID
cursor.execute("SELECT * FROM Courses WHERE InstructorID = 1")
courses_by_instructor_1 = cursor.fetchall()
print("\nCourses taught by InstructorID 1:")
for course in courses_by_instructor_1:
    print(course)

Courses taught by InstructorID 1:
(1, 'Introduction to AI', 'Learn the basics of AI', 50, '2024-01-01', '2024-06-01', 1, 1)

In [28]:
# 3. Retrieve courses where the description contains 'AI' or 'Python' using OR
cursor.execute("SELECT * FROM Courses WHERE Description LIKE '%AI%' OR Description LIKE '%Python%'")
courses_with_AI_or_Python_description = cursor.fetchall()
print("\nCourses where description contains 'AI' or 'Python':")
for course in courses_with_AI_or_Python_description:
    print(course)

Courses where description contains 'AI' or 'Python':
(1, 'Introduction to AI', 'Learn the basics of AI', 50, '2024-01-01', '2024-06-01', 1, 1)
(4, 'Advanced Python', 'Python programming for advanced users', 25, '2024-01-15', '2024-05-15', None, 4)

In [29]:
# 4. Retrieve courses that do not have a prerequisite using IS NULL
cursor.execute("SELECT * FROM Courses WHERE PrerequisiteID IS NULL")
courses_no_prerequisite = cursor.fetchall()
print("\nCourses that do not have a prerequisite:")
for course in courses_no_prerequisite:
    print(course)

Courses that do not have a prerequisite:
(4, 'Advanced Python', 'Python programming for advanced users', 25, '2024-01-15', '2024-05-15', None, 4)

In [30]:
# 5. Retrieve courses sorted by start date in ascending order
cursor.execute("SELECT * FROM Courses ORDER BY StartDate ASC")
courses_sorted_by_start_date = cursor.fetchall()
print("\nCourses sorted by start date in ascending order:")
for course in courses_sorted_by_start_date:
    print(course)

Courses sorted by start date in ascending order:
(1, 'Introduction to AI', 'Learn the basics of AI', 50, '2024-01-01', '2024-06-01', 1, 1)
(4, 'Advanced Python', 'Python programming for advanced users', 25, '2024-01-15', '2024-05-15', None, 4)
(2, 'Cybersecurity Basics', 'Understand cybersecurity concepts', 40, '2024-02-01', '2024-07-01', 2, 2)
(3, 'Data Science Fundamentals', 'Foundations of data science', 30, '2024-03-01', '2024-08-01', 3, 3)
(5, 'Machine Learning Essentials', 'Basics of ML techniques', 35, '2024-04-01', '2024-09-01', 4, 5)

In [31]:
# Aggregate Functions
# a. Find the total maximum enrollment across all courses
cursor.execute("SELECT SUM(MaxEnrollment) AS Total_Enrollment FROM Courses")
total_enrollment = cursor.fetchone()
print("\nTotal Maximum Enrollment:", total_enrollment[0])

# b. Find the course with the earliest start date
cursor.execute("SELECT MIN(StartDate) AS Earliest_Course FROM Courses")
earliest_course = cursor.fetchone()
print("\nCourse with the Earliest Start Date:", earliest_course[0])

Total Maximum Enrollment: 180

Course with the Earliest Start Date: 2024-01-01

## Joins

In [32]:
cursor.execute("""
    SELECT 
        Students.First_Name, Students.Last_Name, Enrollment.Status, Enrollment.EnrollmentDate
    FROM 
        Students
    INNER JOIN 
        Enrollment ON Students.StudentID = Enrollment.StudentID
""")
inner_join_students_enrollment = cursor.fetchall()
print("\nInner Join Students and Enrollment:")
for row in inner_join_students_enrollment:
    print(row)

Inner Join Students and Enrollment:
('Ahmad', 'Al-Faisal', 'Active', '2024-01-05')
('Layla', 'Al-Zahrani', 'Completed', '2024-01-05')
('Omar', 'Al-Harbi', 'Active', '2024-01-10')
('Sara', 'Al-Qahtani', 'Dropped', '2024-01-15')
('Yousef', 'Al-Subaie', 'Completed', '2024-01-20')

In [33]:
cursor.execute("""
    SELECT 
        Courses.CourseName, Courses.Description, Instructors.First_Name AS Instructor_FirstName, Instructors.Last_Name AS Instructor_LastName
    FROM 
        Courses
    LEFT JOIN 
        Instructors ON Courses.InstructorID = Instructors.InstructorID
""")
left_outer_join_courses_instructors = cursor.fetchall()
print("\nLeft Outer Join Courses and Instructors:")
for row in left_outer_join_courses_instructors:
    print(row)

Left Outer Join Courses and Instructors:
('Introduction to AI', 'Learn the basics of AI', 'Hassan', 'Al-Omari')
('Cybersecurity Basics', 'Understand cybersecurity concepts', 'Sanaa', 'Al-Shammari')
('Data Science Fundamentals', 'Foundations of data science', 'Noura', 'Al-Saadi')
('Advanced Python', 'Python programming for advanced users', 'Ali', 'Al-Bakri')
('Machine Learning Essentials', 'Basics of ML techniques', 'Salem', 'Al-Hazmi')

In [34]:
# Union Between Students and Instructors
cursor.execute("""
    SELECT 
        Students.First_Name, Students.Last_Name, Students.StudentID as ID
    FROM 
        Students
    UNION
    SELECT 
        Instructors.First_Name, Instructors.Last_Name, Instructors.InstructorID as ID
    FROM 
        Instructors
""")
union_students_instructors = cursor.fetchall()
print("\nSimple Union: Students and Instructors:")
for row in union_students_instructors:
    print(row)

Simple Union: Students and Instructors:
('Ahmad', 'Al-Faisal', 1)
('Ali', 'Al-Bakri', 4)
('Hassan', 'Al-Omari', 1)
('Layla', 'Al-Zahrani', 2)
('Noura', 'Al-Saadi', 3)
('Omar', 'Al-Harbi', 3)
('Salem', 'Al-Hazmi', 5)
('Sanaa', 'Al-Shammari', 2)
('Sara', 'Al-Qahtani', 4)
('Yousef', 'Al-Subaie', 5)

## Views

In [36]:
# cursor.execute("""
#     CREATE VIEW Active_Students AS
#     SELECT 
#         Students.First_Name, Students.Last_Name, Enrollment.Status, Courses.CourseName
#     FROM 
#         Students
#     JOIN 
#         Enrollment ON Students.StudentID = Enrollment.StudentID
#     JOIN 
#         Courses ON Enrollment.CourseID = Courses.CourseID
#     WHERE 
#         Enrollment.Status = 'Active'
# """)
cursor.execute("SELECT * FROM Active_Students")
active_students = cursor.fetchall()
print("\nActive Students View:")
for student in active_students:
    print(student)

Active Students View:
('Ahmad', 'Al-Faisal', 'Active', 'Introduction to AI')
('Omar', 'Al-Harbi', 'Active', 'Data Science Fundamentals')

In [37]:
# View for Students Not Enrolled in Any Course
# cursor.execute("""
#     CREATE VIEW Students_Not_Enrolled AS
#     SELECT 
#         Students.First_Name, Students.Last_Name, Students.Username
#     FROM 
#         Students
#     LEFT JOIN 
#         Enrollment ON Students.StudentID = Enrollment.StudentID
#     WHERE 
#         Enrollment.StudentID IS NULL
# """)
cursor.execute("SELECT * FROM Students_Not_Enrolled")
students_not_enrolled = cursor.fetchall()
print("\nStudents Not Enrolled in Any Course:")
print(students_not_enrolled)

Students Not Enrolled in Any Course:
[]

In [38]:
cursor.execute("DROP VIEW Total_Students_Per_Course")

In [40]:
# Create a View for Total Students Enrolled in Each Course
# cursor.execute("""
#     CREATE VIEW Total_Students_Per_Course AS
#     SELECT 
#         Courses.CourseName,
#         COUNT(Enrollment.StudentID) AS Total_Students
#     FROM 
#         Courses
#     LEFT JOIN 
#         Enrollment ON Courses.CourseID = Enrollment.CourseID
#     GROUP BY 
#         Courses.CourseName
# """)

# Execute and fetch data from the newly created view
cursor.execute("SELECT * FROM Total_Students_Per_Course")
total_students_per_course = cursor.fetchall()

# Display the result
print("\nTotal Students Per Course:")
for course in total_students_per_course:
    print(course)

Total Students Per Course:
('Advanced Python', 1)
('Cybersecurity Basics', 1)
('Data Science Fundamentals', 1)
('Introduction to AI', 1)
('Machine Learning Essentials', 1)